pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/cs.c
//*****************************************************************************
//
// cs.c - Driver for the cs Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup cs_api cs
//! @{
//
//*****************************************************************************

#include "inc/hw_memmap.h"

#if defined(__MSP430_HAS_CS__) || defined(__MSP430_HAS_SFR__)
#include "cs.h"

#include <assert.h>

//*****************************************************************************
//
// The following value is used by CS_getACLK, CS_getSMCLK, CS_getMCLK to
// determine the operating frequency based on the available DCO frequencies.
//
//*****************************************************************************
#define CS_DCO_FREQ_1                                            1000000
#define CS_DCO_FREQ_2                                            2670000
#define CS_DCO_FREQ_3                                            3330000
#define CS_DCO_FREQ_4                                            4000000
#define CS_DCO_FREQ_5                                            5330000
#define CS_DCO_FREQ_6                                            6670000
#define CS_DCO_FREQ_7                                            8000000
#define CS_DCO_FREQ_8                                           16000000
#define CS_DCO_FREQ_9                                           20000000
#define CS_DCO_FREQ_10                                          24000000

//*****************************************************************************
//
// Internal very low power VLOCLK, low frequency oscillator with 10kHz typical
// frequency, internal low-power oscillator MODCLK with 5 MHz typical
// frequency and LFMODCLK is MODCLK divided by 128.
//
//*****************************************************************************
#define CS_VLOCLK_FREQUENCY                                        10000
#define CS_MODCLK_FREQUENCY                                      5000000
#define CS_LFMODCLK_FREQUENCY                                      39062

//*****************************************************************************
//
// The following value is used by CS_XT1Start, CS_bypassXT1,
// CS_XT1StartWithTimeout, CS_bypassXT1WithTimeout to properly set
// the XTS bit. This frequency threshold is specified in the User's Guide.
//
//*****************************************************************************
#define LFXT_FREQUENCY_THRESHOLD                                          50000

//*****************************************************************************
//
// LFXT crystal frequency. Should be set with
// CS_externalClockSourceInit if LFXT is used and user intends to invoke
// CS_getSMCLK, CS_getMCLK, CS_getACLK and
// CS_turnOnLFXT, CS_LFXTByPass, CS_turnOnLFXTWithTimeout,
// CS_LFXTByPassWithTimeout.
//
//*****************************************************************************
static uint32_t privateLFXTClockFrequency = 0;

//*****************************************************************************
//
// The HFXT crystal frequency. Should be set with
// CS_externalClockSourceInit if HFXT is used and user intends to invoke
// CS_getSMCLK, CS_getMCLK, CS_getACLK,
// CS_turnOnLFXT, CS_LFXTByPass, CS_turnOnLFXTWithTimeout,
// CS_LFXTByPassWithTimeout.
//
//*****************************************************************************
static uint32_t privateHFXTClockFrequency = 0;

static uint32_t privateCSASourceClockFromDCO (uint8_t clockdivider)
{
    uint32_t CLKFrequency = 0;

    if (HWREG16(CS_BASE + OFS_CSCTL1)& DCORSEL) {
            switch(HWREG16(CS_BASE + OFS_CSCTL1) & DCOFSEL_7) {
                case DCOFSEL_0:
                    CLKFrequency=CS_DCO_FREQ_1/clockdivider;
                    break;
                case DCOFSEL_1:
                    CLKFrequency=CS_DCO_FREQ_5/clockdivider;
                    break;
                case DCOFSEL_2:
                    CLKFrequency=CS_DCO_FREQ_6/clockdivider;
                    break;
                case DCOFSEL_3:
                    CLKFrequency=CS_DCO_FREQ_7/clockdivider;
                    break;
                case DCOFSEL_4:
                    CLKFrequency=CS_DCO_FREQ_8/clockdivider;
                    break;
                case DCOFSEL_5:
                    CLKFrequency=CS_DCO_FREQ_9/clockdivider;
                    break;
                case DCOFSEL_6:
                case DCOFSEL_7:
                    CLKFrequency=CS_DCO_FREQ_10/clockdivider;
                    break;
                default:
                    CLKFrequency=0;
                    break;
            }
        }
        else {
            switch(HWREG16(CS_BASE + OFS_CSCTL1) & DCOFSEL_7) {
                case DCOFSEL_0:
                    CLKFrequency=CS_DCO_FREQ_1/clockdivider;
                    break;
                case DCOFSEL_1:
                    CLKFrequency=CS_DCO_FREQ_2/clockdivider;
                    break;
                case DCOFSEL_2:
                    CLKFrequency=CS_DCO_FREQ_3/clockdivider;
                    break;
                case DCOFSEL_3:
                    CLKFrequency=CS_DCO_FREQ_4/clockdivider;
                    break;
                case DCOFSEL_4:
                    CLKFrequency=CS_DCO_FREQ_5/clockdivider;
                    break;
                case DCOFSEL_5:
                    CLKFrequency=CS_DCO_FREQ_6/clockdivider;
                    break;
                case DCOFSEL_6:
                case DCOFSEL_7:
                    CLKFrequency=CS_DCO_FREQ_7/clockdivider;
                    break;
                default:
                    CLKFrequency=0;
                    break;
            }

        }

    return (CLKFrequency);
}

static uint32_t privateCSAComputeCLKFrequency (uint16_t CLKSource,
    uint16_t CLKSourceDivider
    )
{
    uint32_t CLKFrequency = 0;
    uint8_t CLKSourceFrequencyDivider = 1;
    uint8_t i = 0;

    //Determine Frequency divider
    for ( i = 0; i < CLKSourceDivider; i++) {
        CLKSourceFrequencyDivider *= 2;
    }

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

