pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/cs.c
    //Determine clock source based on CLKSource
    switch (CLKSource) {

        //If LFXT is selected as clock source
        case SELM__LFXTCLK:
            CLKFrequency = (privateLFXTClockFrequency /
                            CLKSourceFrequencyDivider);

            //Check if LFXTOFFG is not set. If fault flag is set
            //VLO is used as source clock
            if (HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG) {
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG);
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                if (HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG) {
                            CLKFrequency = CS_LFMODCLK_FREQUENCY;
                }
            }
            break;

        case SELM__VLOCLK:
            CLKFrequency =
                (CS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
            break;

        case SELM__LFMODOSC:
            CLKFrequency =
                (CS_LFMODCLK_FREQUENCY / CLKSourceFrequencyDivider);

            break;

        case SELM__DCOCLK:
            CLKFrequency =
            privateCSASourceClockFromDCO( CLKSourceFrequencyDivider);

            break;

        case SELM__MODOSC:
            CLKFrequency =
                (CS_MODCLK_FREQUENCY / CLKSourceFrequencyDivider);

            break;

        case SELM__HFXTCLK:
            CLKFrequency =
                (privateHFXTClockFrequency / CLKSourceFrequencyDivider);

            if (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {

                HWREG8(CS_BASE + OFS_CSCTL5) &= ~HFXTOFFG;
                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
            }

            if (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {
                CLKFrequency = CS_MODCLK_FREQUENCY;
            }
            break;
    }

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    return (CLKFrequency);
}

void CS_setExternalClockSource (uint32_t LFXTCLK_frequency,
    uint32_t HFXTCLK_frequency
    )
{
    privateLFXTClockFrequency = LFXTCLK_frequency;
    privateHFXTClockFrequency = HFXTCLK_frequency;
}

void CS_initClockSignal (uint8_t selectedClockSignal,
    uint16_t clockSource,
    uint16_t clockSourceDivider
    )
{

    //Verify User has selected a valid Frequency divider
    assert(
            (CS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
            (CS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
            (CS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
            (CS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
            (CS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
            (CS_CLOCK_DIVIDER_32 == clockSourceDivider)
            );

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    uint16_t temp = HWREG16(CS_BASE + OFS_CSCTL3);
    switch (selectedClockSignal) {
        case CS_ACLK:
            assert(
                    (CS_LFXTCLK_SELECT == clockSource)  ||
                    (CS_VLOCLK_SELECT == clockSource)   ||
                    (CS_LFMODOSC_SELECT == clockSource)
                    );

            clockSourceDivider = clockSourceDivider << 8;
            clockSource = clockSource << 8;

            HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELA_7);
            HWREG16(CS_BASE + OFS_CSCTL2) |= (clockSource);
            HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVA0 + DIVA1 + DIVA2) | 
                                                clockSourceDivider;
            break;
        case CS_SMCLK:
            assert(
                (CS_LFXTCLK_SELECT == clockSource) ||
                (CS_VLOCLK_SELECT  == clockSource) ||
                (CS_DCOCLK_SELECT  == clockSource) ||
                (CS_HFXTCLK_SELECT == clockSource) ||
                (CS_LFMODOSC_SELECT== clockSource) ||
                (CS_MODOSC_SELECT  == clockSource)
                );

            clockSource = clockSource << 4;
            clockSourceDivider = clockSourceDivider << 4;

            HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELS_7);
            HWREG16(CS_BASE + OFS_CSCTL2) |= clockSource;
            HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVS0 + DIVS1 + DIVS2) |
                                                clockSourceDivider;
            break;
        case CS_MCLK:
            assert(
            (CS_LFXTCLK_SELECT == clockSource) ||
            (CS_VLOCLK_SELECT  == clockSource) ||
            (CS_DCOCLK_SELECT  == clockSource) ||
            (CS_HFXTCLK_SELECT == clockSource) ||
            (CS_LFMODOSC_SELECT== clockSource) ||
            (CS_MODOSC_SELECT  == clockSource)
            );

            HWREG16(CS_BASE + OFS_CSCTL2) &= ~(SELM_7);
            HWREG16(CS_BASE + OFS_CSCTL2) |= clockSource;
            HWREG16(CS_BASE + OFS_CSCTL3) = temp & ~(DIVM0 + DIVM1 + DIVM2) |
                                                clockSourceDivider;
            break;
    }

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_turnOnLFXT (uint16_t lfxtdrive
    )
{
    assert(privateLFXTClockFrequency != 0);

    assert((lfxtdrive == CS_LFXT_DRIVE_0 ) ||
           (lfxtdrive == CS_LFXT_DRIVE_1 ) ||
           (lfxtdrive == CS_LFXT_DRIVE_2 ) ||
           (lfxtdrive == CS_LFXT_DRIVE_3 ));

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch ON LFXT oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~LFXTOFF;

    //Highest drive setting for LFXTstartup
    HWREG16(CS_BASE + OFS_CSCTL4_L) |= LFXTDRIVE1_L + LFXTDRIVE0_L;

    HWREG16(CS_BASE + OFS_CSCTL4) &= ~LFXTBYPASS;

    //Wait for Crystal to stabilize
    while (HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //Set requested Drive mode
    HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
            ~(LFXTDRIVE_3)
            ) |
        (lfxtdrive);

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

