pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/cs.c
void CS_bypassHFXT (void)
{
    //Verify user has initialized value of HFXTClock
    assert(privateHFXTClockFrequency != 0);

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch off HFXT oscillator and set it to BYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) |= ( HFXTBYPASS + HFXTOFF );

    //If HFFrequency is (16, 24] MHz
    if (privateHFXTClockFrequency > 16000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_3;
    }
    //If HFFrequency is (8, 16] MHz
    else if (privateHFXTClockFrequency > 8000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_2;
    }
    //If HFFrequency is (4, 8] MHz
    else if (privateHFXTClockFrequency > 4000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_1;
    }
    //If HFFrequency is [0, 4] MHz
    else {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
    }

    while (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

bool CS_turnOnHFXTWithTimeout (uint16_t hfxtdrive,
    uint32_t timeout
    )
{
    //Verify user has initialized value of HFXTClock
    assert(privateHFXTClockFrequency != 0);

    assert(timeout > 0);

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch on HFXT oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTOFF;

    //Disable HFXTBYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTBYPASS;

    //If HFFrequency is (16, 24] MHz
    if (privateHFXTClockFrequency > 16000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_3;
    }
    //If HFFrequency is (8, 16] MHz
    else if (privateHFXTClockFrequency > 8000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_2;
    }
    //If HFFrequency is (4, 8] MHz
    else if (privateHFXTClockFrequency > 4000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_1;
    }
    //If HFFrequency is [0, 4] MHz
    else {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
    }

    while ((HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) && --timeout)
    {
        //Clear OSC fault Flags fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

        // Clear the global fault flag. In case the LFXT caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

    }

    if (timeout) {
        //Set drive strength for HFXT
        HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                             ~(CS_HFXT_DRIVE_24MHZ_32MHZ)
                                             ) |
                                           (hfxtdrive);
        //Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
        return (STATUS_SUCCESS);
    }
    else {
        //Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
        return (STATUS_FAIL);
    }
}

bool CS_bypassHFXTWithTimeout (uint32_t timeout
    )
{
    //Verify user has initialized value of HFXTClock
    assert(privateHFXTClockFrequency != 0);

    assert(timeout > 0);

    // Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //If HFFrequency is (16, 24] MHz
    if (privateHFXTClockFrequency > 16000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_3;
    }
    //If HFFrequency is (8, 16] MHz
    else if (privateHFXTClockFrequency > 8000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_2;
    }
    //If HFFrequency is (4, 8] MHz
    else if (privateHFXTClockFrequency > 4000000) {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
        HWREG16(CS_BASE + OFS_CSCTL4) |= HFFREQ_1;
    }
    //If HFFrequency is [0, 4] MHz
    else {
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFFREQ_3;
    }

    //Switch off HFXT oscillator and enable BYPASS mode
    HWREG16(CS_BASE + OFS_CSCTL4) |= (HFXTBYPASS + HFXTOFF);

    while ((HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) && --timeout)
    {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

        // Clear the global fault flag. In case the LFXT caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    if (timeout) {
        return (STATUS_SUCCESS);
    }
    else {
        return (STATUS_FAIL);
    }
}

void CS_turnOffHFXT (void)
{
    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Switch off HFXT oscillator
    HWREG16(CS_BASE + OFS_CSCTL4) |= HFXTOFF;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_enableClockRequest (uint8_t selectClock
    )
{
    assert(
            (CS_ACLK  == selectClock )||
            (CS_SMCLK == selectClock )||
            (CS_MCLK  == selectClock )||
            (CS_MODOSC== selectClock ));

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG8(CS_BASE + OFS_CSCTL6) |= selectClock;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

void CS_disableClockRequest (uint8_t selectClock
    )
{
    assert(
            (CS_ACLK  == selectClock )||
            (CS_SMCLK == selectClock )||
            (CS_MCLK  == selectClock )||
            (CS_MODOSC== selectClock ));

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

