pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/cs.c
    HWREG8(CS_BASE + OFS_CSCTL6) &= ~selectClock;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

uint8_t CS_getFaultFlagStatus (uint8_t mask
    )
{
    assert(
                (CS_HFXTOFFG == mask )||
                (CS_LFXTOFFG == mask )
                );
    return (HWREG8(CS_BASE + OFS_CSCTL5) & mask);
}

void CS_clearFaultFlag (uint8_t mask
    )
{
    assert(
            (CS_HFXTOFFG == mask )||
            (CS_LFXTOFFG == mask )
            );

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG8(CS_BASE + OFS_CSCTL5) &= ~mask;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

uint32_t CS_getACLK (void)
{

    //Find ACLK source
    uint16_t ACLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELA_7);
    ACLKSource = ACLKSource >> 8;

    //Find ACLK frequency divider
    uint16_t ACLKSourceDivider = HWREG16(CS_BASE + OFS_CSCTL3) & SELA_7;
    ACLKSourceDivider = ACLKSourceDivider >> 8;

    return (privateCSAComputeCLKFrequency(
                ACLKSource,
                ACLKSourceDivider));

}

uint32_t CS_getSMCLK (void)
{
        //Find SMCLK source
        uint16_t SMCLKSource = HWREG8(CS_BASE + OFS_CSCTL2) & SELS_7;

        SMCLKSource = SMCLKSource >> 4;

        //Find SMCLK frequency divider
        uint16_t SMCLKSourceDivider = HWREG16(CS_BASE + OFS_CSCTL3) & SELS_7;
        SMCLKSourceDivider = SMCLKSourceDivider >> 4;

        return (privateCSAComputeCLKFrequency(
                    SMCLKSource,
                    SMCLKSourceDivider )
                );
}

uint32_t CS_getMCLK (void)
{
        //Find MCLK source
        uint16_t MCLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELM_7);
        //Find MCLK frequency divider
        uint16_t MCLKSourceDivider = HWREG16(CS_BASE + OFS_CSCTL3) & SELM_7;

        return (privateCSAComputeCLKFrequency(
                    MCLKSource,
                    MCLKSourceDivider )
                );
}

void CS_turnOffVLO(void)
{
    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    HWREG16(CS_BASE + OFS_CSCTL4) |= VLOOFF;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

uint16_t CS_clearAllOscFlagsWithTimeout(uint32_t timeout)
{
    assert(timeout > 0);

    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    do {
        //Clear all osc fault flags
        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG + HFXTOFFG);

        //Clear the global osc fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

        //Check LFXT fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

    return (HWREG8(CS_BASE + OFS_CSCTL5) & (LFXTOFFG + HFXTOFFG));
}

void CS_setDCOFreq(uint16_t dcorsel,
        uint16_t dcofsel)
{
    assert(
                (dcofsel==CS_DCOFSEL_0)||
                (dcofsel==CS_DCOFSEL_1)||
                (dcofsel==CS_DCOFSEL_2)||
                (dcofsel==CS_DCOFSEL_3)||
                (dcofsel==CS_DCOFSEL_4)||
                (dcofsel==CS_DCOFSEL_5)||
                (dcofsel==CS_DCOFSEL_6)
                );

    //Verify user has selected a valid DCO Frequency Range option
    assert(
            (dcorsel==CS_DCORSEL_0)||
            (dcorsel==CS_DCORSEL_1));

    uint16_t tempCSCTL3 = 0;
    //Unlock CS control register
    HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

    //Assuming SMCLK and MCLK are sourced from DCO
    //Store CSCTL3 settings to recover later
    tempCSCTL3 = HWREG16(CS_BASE + OFS_CSCTL3);

    //Keep overshoot transient within specification by setting clk
    //sources to divide by 4
    //Clear the DIVS & DIVM masks (~0x77) and set both fields to 4 divider
    HWREG16(CS_BASE + OFS_CSCTL3) = HWREG16(CS_BASE + OFS_CSCTL3) &
        (~(0x77)) | DIVS1 | DIVM1;

    //Set user's frequency selection for DCO
    HWREG16(CS_BASE + OFS_CSCTL1) = (dcorsel + dcofsel);

    //Delay by ~10us to let DCO settle. cycles to wait = 20 cycles buffer + 
    //(10us * (x MHz/4))
    switch(dcofsel)
    {
        case(CS_DCOFSEL_0):
            //1 MHz or 1 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(23) : __delay_cycles(23);
            break;
        case(CS_DCOFSEL_1):
            //2.67 MHz or 5.33 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(27) : __delay_cycles(34);
            break;
        case(CS_DCOFSEL_2):
            //3.33 MHz or 6.67 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(29) : __delay_cycles(37);
            break;
        case(CS_DCOFSEL_3):
            //4 MHz or 8 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(30) : __delay_cycles(40);
            break;
        case(CS_DCOFSEL_4):
            //5.33 MHz or 16 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(34) : __delay_cycles(60);
            break;
        case(CS_DCOFSEL_5):
            //6.67 MHz or 21 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(37) : __delay_cycles(73);
            break;
        case(CS_DCOFSEL_6):
            //8 MHz or 24 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
            break;
        default:
            //Should not be used, but default is 8 MHz or 24 MHz
            (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
            break;
    }

    //Set all dividers
    HWREG16(CS_BASE + OFS_CSCTL3) = tempCSCTL3;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
